import './Handler.css'
export default function Handler() {

    // নর্মাল ফাংশন
    function FirstHandleClick() {
        alert('First Button Clicked')
    }

    // এর‍্যো ফাংশন
    const SecondHandleClick = () => {
        alert('Second Button Clicked')
    }

    // এর‍্যো ফাংশন ক্লিক করলে প্যারামিটার নিয়ে কাজ করবে, প্যারামিটার এর সাথে ৫ যোগ করে রিটার্ন করবে।
    const ThirdHandleClick = (num) => {
        alert(num + 5)
    }
    return (
        <div className="HandlerDiv">
            {/* বাটনের মধ্যে একটা ওনক্লিক ইভেন্ট হেন্ডেলার ইউজ করলাম। এই ইভেন্ট হ্যান্ডেল করার জন্য রিটার্নের উপর একটা নর্মাল ফাংশন লিখছি। কিন্ত এখানে ইভেন্ট হ্যান্ডেলারে ফাংশন কল করা যাবে না, শুধু সেকেন্ড ব্র্যেকেটে রাখলেই হবে।  */}
            <button onClick={FirstHandleClick}>First Button</button>

            {/* বাটনের মধ্যে একটা ওনক্লিক ইভেন্ট হেন্ডেলার ইউজ করলাম। এই ইভেন্ট হ্যান্ডেল করার জন্য রিটার্নের উপর একটা এর‍্যো ফাংশন লিখছি। কিন্ত এখানে ইভেন্ট হ্যান্ডেলারে ফাংশন কল করা যাবে না, শুধু সেকেন্ড ব্র্যেকেটে রাখলেই হবে।  */}
            <button onClick={SecondHandleClick}>Second Burtton</button>

            {/* বাটনের মধ্যে একটা ওনক্লিক ইভেন্ট হেন্ডেলার ইউজ করলাম। এই ইভেন্ট হ্যান্ডেল করার জন্য রিটার্নের উপর একটা এর‍্যো ফাংশন লিখছি। এরো ফাংশনে যদি প্যারামিটার পাঠানো হয় তাহলে সরাসরি কল হয়ে যায়। তাই ফাংশন টাকে অন ক্লিক হ্যান্ডেলার এর মধ্যে নতুন একটা এক্সট্রা ফাংশোন দিয়ে র‍্যাপ করে দিতে হবে।  */}
            <button onClick={() => ThirdHandleClick(5)}>Third Button</button>

        </div>
    )
}